Revit 2027 API
FormArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual FormArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As FormArrayIterator
public:
virtual FormArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> FormArrayIterator
override ForwardIterator : unit -> FormArrayIterator
Return Value
FormArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
FormArray Class
Autodesk.Revit.DB Namespace